; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v8)
             (pred_7 ?v4 ?v11)
             (pred_10 ?v5 ?v11)
             (pred_8 ?v9 ?v5 )
	     (pred_5 ?v5)
             (pred_4 ?v13)
             (pred_12 ?v4)
             (pred_2 ?v11)
             (pred_3 ?v5)
             (pred_6 ?v4)
             (pred_1 ?v5)
             (pred_9 ))



(:action op_3
:parameters (?v1 ?v2 ?v3 ?v6)
:precondition (and (pred_4 ?v1) (pred_4 ?v2) (pred_12 ?v3) (pred_2 ?v6)
          (pred_11 ?v1 ?v2) (pred_7 ?v3 ?v6)
                   (pred_10 ?v2 ?v6) (pred_5 ?v1) 
                   (pred_3 ?v2) (pred_6 ?v3))
:effect (and  (pred_1 ?v2) (not (pred_3 ?v2))))


(:action op_5
:parameters (?v1 ?v12)
:precondition (and (pred_4 ?v1) (pred_4 ?v12)
               (pred_5 ?v1) (pred_11 ?v1 ?v12) (pred_1 ?v12))
:effect (and (pred_5 ?v12) (not (pred_5 ?v1))))

(:action op_2
:parameters (?v1 ?v3)
:precondition (and (pred_4 ?v1) (pred_12 ?v3) 
                  (pred_5 ?v1) (pred_8 ?v3 ?v1) (pred_9 ))
:effect (and (pred_6 ?v3)
   (not (pred_8 ?v3 ?v1)) (not (pred_9 ))))


(:action op_1
:parameters (?v1 ?v10 ?v7)
:precondition (and (pred_4 ?v1) (pred_12 ?v10) (pred_12 ?v7)
                  (pred_5 ?v1) (pred_6 ?v7) (pred_8 ?v10 ?v1))
:effect (and (pred_6 ?v10) (pred_8 ?v7 ?v1)
        (not (pred_6 ?v7)) (not (pred_8 ?v10 ?v1))))

(:action op_4
:parameters (?v1 ?v3)
:precondition (and (pred_4 ?v1) (pred_12 ?v3) 
                  (pred_5 ?v1) (pred_6 ?v3))
:effect (and (pred_9 ) (pred_8 ?v3 ?v1) (not (pred_6 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_18 obj_13 obj_12 obj_21 obj_14 obj_04 obj_07 obj_01 obj_05 obj_03 obj_11 obj_15 obj_09 obj_19 obj_17
    obj_10 obj_20
    obj_16 obj_06 obj_02
    )

    (:init
       (pred_9)

       (pred_4 obj_08)
       (pred_4 obj_18)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_21)
       (pred_4 obj_14)
       (pred_4 obj_04)
       (pred_4 obj_07)
       (pred_4 obj_01)
       (pred_4 obj_05)
       (pred_4 obj_03)
       (pred_4 obj_11)
       (pred_4 obj_15)
       (pred_4 obj_09)
       (pred_4 obj_19)
       (pred_4 obj_17)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_12 obj_16)
       (pred_12 obj_06)
       (pred_12 obj_02)

       (pred_11 obj_08 obj_21)
       (pred_11 obj_08 obj_18)
       (pred_11 obj_18 obj_14)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_18 obj_08)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_12 obj_07)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_21 obj_01)
       (pred_11 obj_21 obj_14)
       (pred_11 obj_21 obj_08)
       (pred_11 obj_14 obj_05)
       (pred_11 obj_14 obj_04)
       (pred_11 obj_14 obj_18)
       (pred_11 obj_14 obj_21)
       (pred_11 obj_04 obj_03)
       (pred_11 obj_04 obj_07)
       (pred_11 obj_04 obj_13)
       (pred_11 obj_04 obj_14)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_07 obj_12)
       (pred_11 obj_07 obj_04)
       (pred_11 obj_01 obj_15)
       (pred_11 obj_01 obj_05)
       (pred_11 obj_01 obj_21)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_05 obj_03)
       (pred_11 obj_05 obj_14)
       (pred_11 obj_05 obj_01)
       (pred_11 obj_03 obj_19)
       (pred_11 obj_03 obj_11)
       (pred_11 obj_03 obj_04)
       (pred_11 obj_03 obj_05)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_11 obj_03)
       (pred_11 obj_15 obj_09)
       (pred_11 obj_15 obj_01)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_15)
       (pred_11 obj_19 obj_17)
       (pred_11 obj_19 obj_03)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_19)
       (pred_3 obj_05)
       (pred_3 obj_14)
       (pred_3 obj_04)
       (pred_10  obj_05 obj_10)
       (pred_10  obj_14 obj_20)
       (pred_10  obj_04 obj_20)
       (pred_1 obj_08)
       (pred_1 obj_18)
       (pred_1 obj_13)
       (pred_1 obj_12)
       (pred_1 obj_21)
       (pred_1 obj_07)
       (pred_1 obj_01)
       (pred_1 obj_03)
       (pred_1 obj_11)
       (pred_1 obj_15)
       (pred_1 obj_09)
       (pred_1 obj_19)
       (pred_1 obj_17)

       (pred_7  obj_16 obj_10)
       (pred_7  obj_06 obj_20)
       (pred_7  obj_02 obj_20)
       (pred_8 obj_16 obj_15)
       (pred_8 obj_06 obj_11)
       (pred_8 obj_02 obj_17)
       (pred_5 obj_17)
    )

    (:goal (and
       (pred_8 obj_02 obj_15)
    ))
(:constraints
  (always (not (pred_5 obj_19)))
)
)

; plan
1. (op_2 obj_17 obj_02)
   deleted: (pred_8 obj_02 obj_17) (pred_9)
   added: (pred_6 obj_02)
   goals met: 0 of 1
2. (op_5 obj_17 obj_11)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_11)
   goals met: 0 of 1
3. (op_5 obj_11 obj_03)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_03)
   goals met: 0 of 1
4. (op_3 obj_03 obj_04 obj_02 obj_20)
   deleted: (pred_3 obj_04)
   added: (pred_1 obj_04)
   goals met: 0 of 1
5. (op_5 obj_03 obj_04)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_04)
   goals met: 0 of 1
6. (op_3 obj_04 obj_14 obj_02 obj_20)
   deleted: (pred_3 obj_14)
   added: (pred_1 obj_14)
   goals met: 0 of 1
7. (op_5 obj_04 obj_14)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_14)
   goals met: 0 of 1
8. (op_5 obj_14 obj_21)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_21)
   goals met: 0 of 1
9. (op_5 obj_21 obj_01)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_01)
   goals met: 0 of 1
10. (op_5 obj_01 obj_15)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_15)
   goals met: 0 of 1
11. (op_1 obj_15 obj_16 obj_02)
   deleted: (pred_6 obj_02) (pred_8 obj_16 obj_15)
   added: (pred_6 obj_16) (pred_8 obj_02 obj_15)
   goals met: 1 of 1
